# MultiServerService Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiServerService Class
Members See Also
---
This class represents a multi-server service inside Revit application. It is created when an instance of IMultiServerService is registered with Revit.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class MultiServerService : ExternalService
```

Visual Basic
---
```text
Public Class MultiServerService _
	Inherits ExternalService
```

Visual C++
---
```text
public ref class MultiServerService : public ExternalService
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.ExternalService..::..ExternalService Autodesk.Revit.DB.ExternalService..::..MultiServerService
# See Also
MultiServerService Members
Autodesk.Revit.DB.ExternalService Namespace